### List of Changed Stacks

```bash
stacks/client-1
exitcode=0
stdout<<EOF
stacks/client-1
EOF
stderr<<EOF
EOF
```

#### Terraform Plan

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master-module.aws_instance.master_instance must be replaced
-/+ resource "aws_instance" "master_instance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:295093822487:instance/i-0d211f1145f1c3bfb" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1d" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0d211f1145f1c3bfb" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0938cf8c220118331" -> (known after apply)
      ~ private_dns                          = "ip-172-31-139-143.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.139.143" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          - "client-1_master_sg",
          + "sg-05998f58d3f29155b",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Client" = "client-1"
            "Name"   = "client-1_master_instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-05998f58d3f29155b",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-02bbe61de12cc856f" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # module.slave-module.aws_autoscaling_group.slave_asg must be replaced
-/+ resource "aws_autoscaling_group" "slave_asg" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:295093822487:autoScalingGroup:55a447b8-b1f6-4ec3-831d-0906c8f4fb10:autoScalingGroupName/client-1-rer_asg" -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "client-1-rer_asg" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ name                             = "client-1-rer_asg" -> "client-1_asg" # forces replacement
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::295093822487:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ vpc_zone_identifier              = [] -> (known after apply)
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0592bf1b6f9efdcb0" -> (known after apply)
          ~ name    = "client-1-rer_template20240509170451543200000002" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.slave-module.aws_launch_template.slave_launch_template must be replaced
-/+ resource "aws_launch_template" "slave_launch_template" {
      ~ arn                     = "arn:aws:ec2:us-east-1:295093822487:launch-template/lt-0592bf1b6f9efdcb0" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "lt-0592bf1b6f9efdcb0" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
      ~ name                    = "client-1-rer_template20240509170451543200000002" -> (known after apply)
      ~ name_prefix             = "client-1-rer_template" -> "client-1_template" # forces replacement
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ tags_all                = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ tag_specifications {
          ~ tags          = {
              ~ "Client" = "client-1-rer" -> "client-1"
              ~ "Name"   = "client-1-rer" -> "client-1"
            }
            # (1 unchanged attribute hidden)
        }
    }

  # module.slave-module.aws_subnet.slave_public_subnet will be updated in-place
  ~ resource "aws_subnet" "slave_public_subnet" {
        id                                             = "subnet-05624ae6f2cb7dc2a"
      ~ tags                                           = {
          ~ "Name" = "client-1-rer_slave_subnet" -> "client-1_slave_subnet"
        }
      ~ tags_all                                       = {
          ~ "Name" = "client-1-rer_slave_subnet" -> "client-1_slave_subnet"
        }
        # (15 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```

<!-- Sticky Pull Request Commentterraform-plan -->